#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.mirrors["sphinxcontrib-autoyaml"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "DUMMY",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.repositories["infrastructure"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mage-os-website"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-magento2"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-adobe-ims"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-adobe-stock-integration"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-composer-dependency-version-audit-plugin"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-composer-root-update-plugin"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-devdocs"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-inventory"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-inventory-composer-installer"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-magento-composer-installer"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-magento2"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-magento2-page-builder"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-magento2-sample-data"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-module-configurable-sample-data-venia"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-page-builder-types"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-security-package"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mirror-zf1"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["namespace"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["terraform"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = (known after apply)
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_membership.users["Vinai"] will be created
  + resource "github_membership" "users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "Vinai"
    }

  # github_membership.users["johnhughes1984"] will be created
  + resource "github_membership" "users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "johnhughes1984"
    }

  # github_membership.users["mage-os-ci"] will be created
  + resource "github_membership" "users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "mage-os-ci"
    }

  # github_membership.users["sprankhub"] will be created
  + resource "github_membership" "users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "sprankhub"
    }

  # github_membership.users["wigman"] will be created
  + resource "github_membership" "users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "wigman"
    }

  # github_repository.mirrors["sphinxcontrib-autoyaml"] will be created
  + resource "github_repository" "mirrors" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "sphinxcontrib-autoyaml"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["infrastructure"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS organization infrastructure discussion and GitHub Actions."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "infrastructure"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mage-os-website"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Source of the mage-os.org website."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mage-os-website"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mageos-magento2"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Work in progress."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mageos-magento2"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-adobe-ims"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/adobe-ims."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-adobe-ims"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-adobe-stock-integration"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/adobe-stock-integration."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-adobe-stock-integration"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-composer-dependency-version-audit-plugin"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/composer-dependency-version-audit-plugin."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-composer-dependency-version-audit-plugin"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-composer-root-update-plugin"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/composer-root-update-plugin."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-composer-root-update-plugin"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-devdocs"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/devdocs."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-devdocs"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-inventory"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/inventory."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-inventory"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-inventory-composer-installer"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/inventory-composer-installer."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-inventory-composer-installer"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-magento-composer-installer"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/magento-composer-installer."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-magento-composer-installer"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-magento2"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/magento2."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-magento2"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-magento2-page-builder"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/magento2-page-builder."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-magento2-page-builder"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-magento2-sample-data"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/magento2-sample-data."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-magento2-sample-data"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-module-configurable-sample-data-venia"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/module-configurable-sample-data-venia."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-module-configurable-sample-data-venia"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-page-builder-types"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/page-builder-types."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-page-builder-types"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-security-package"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/security-package."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-security-package"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["mirror-zf1"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror fork of https://github.com/magento/zf1."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-zf1"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["namespace"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "This repository serves to register the mage-os packagist namespace."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "namespace"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["terraform"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Terraform files for managing the organization repository permissions."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository_file.codeowners["infrastructure"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/infrastructure"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "infrastructure"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mage-os-website"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/content"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mage-os-website"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-magento2"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-magento2"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-adobe-ims"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-adobe-ims"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-adobe-stock-integration"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-adobe-stock-integration"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-composer-dependency-version-audit-plugin"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-composer-dependency-version-audit-plugin"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-composer-root-update-plugin"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-composer-root-update-plugin"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-devdocs"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-devdocs"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-inventory"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-inventory"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-inventory-composer-installer"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-inventory-composer-installer"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-magento-composer-installer"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-magento-composer-installer"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-magento2"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-magento2"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-magento2-page-builder"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-magento2-page-builder"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-magento2-sample-data"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-magento2-sample-data"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-module-configurable-sample-data-venia"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-module-configurable-sample-data-venia"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-page-builder-types"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-page-builder-types"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-security-package"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-security-package"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mirror-zf1"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mirror-zf1"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["namespace"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/infrastructure"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "namespace"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["terraform"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* "
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "terraform"
      + sha                 = (known after apply)
    }

  # github_team.teams["content"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Content mergers"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "content"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["continuous-integration"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Continuous Integration"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "continuous-integration"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["distribution"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Distribution mergers"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "distribution"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["infrastructure"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Infrastructure mergers"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "infrastructure"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["tech-lead"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Technical leaders"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "tech-lead"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.members["Vinai_content"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "Vinai"
    }

  # github_team_membership.members["Vinai_distribution"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "Vinai"
    }

  # github_team_membership.members["Vinai_infrastructure"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "Vinai"
    }

  # github_team_membership.members["Vinai_tech-lead"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "Vinai"
    }

  # github_team_membership.members["johnhughes1984_content"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "johnhughes1984"
    }

  # github_team_membership.members["mage-os-ci_continuous-integration"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "mage-os-ci"
    }

  # github_team_membership.members["sprankhub_distribution"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "sprankhub"
    }

  # github_team_membership.members["sprankhub_infrastructure"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "sprankhub"
    }

  # github_team_membership.members["wigman_content"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "wigman"
    }

  # github_team_repository.teams["infrastructure_infrastructure"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "infrastructure"
      + team_id    = "infrastructure"
    }

  # github_team_repository.teams["mage-os-website_content"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mage-os-website"
      + team_id    = "content"
    }

  # github_team_repository.teams["mageos-magento2_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-magento2"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mirror-adobe-ims_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-adobe-ims"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-adobe-stock-integration_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-adobe-stock-integration"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-composer-dependency-version-audit-plugin_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-composer-dependency-version-audit-plugin"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-composer-root-update-plugin_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-composer-root-update-plugin"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-devdocs_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-devdocs"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-inventory-composer-installer_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-inventory-composer-installer"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-inventory_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-inventory"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-magento-composer-installer_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-magento-composer-installer"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-magento2-page-builder_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-magento2-page-builder"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-magento2-sample-data_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-magento2-sample-data"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-magento2_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-magento2"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-module-configurable-sample-data-venia_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-module-configurable-sample-data-venia"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-page-builder-types_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-page-builder-types"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-security-package_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-security-package"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["mirror-zf1_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mirror-zf1"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["namespace_infrastructure"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "namespace"
      + team_id    = "infrastructure"
    }

  # github_team_repository.tech-lead["infrastructure"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "infrastructure"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mage-os-website"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mage-os-website"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mageos-magento2"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-magento2"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-adobe-ims"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-adobe-ims"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-adobe-stock-integration"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-adobe-stock-integration"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-composer-dependency-version-audit-plugin"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-composer-dependency-version-audit-plugin"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-composer-root-update-plugin"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-composer-root-update-plugin"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-devdocs"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-devdocs"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-inventory"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-inventory"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-inventory-composer-installer"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-inventory-composer-installer"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-magento-composer-installer"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-magento-composer-installer"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-magento2"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-magento2"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-magento2-page-builder"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-magento2-page-builder"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-magento2-sample-data"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-magento2-sample-data"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-module-configurable-sample-data-venia"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-module-configurable-sample-data-venia"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-page-builder-types"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-page-builder-types"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-security-package"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-security-package"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["mirror-zf1"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mirror-zf1"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["namespace"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "namespace"
      + team_id    = (known after apply)
    }

  # github_team_repository.tech-lead["terraform"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "terraform"
      + team_id    = (known after apply)
    }

Plan: 120 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/3308242025